// 1. Создать новую ветку и перейти на нее, удалить строку A, сделать коммит.
// 2. Удалить строку B, сделать коммит, вмержить изменения в ветку master и удалить ветку, в которой работали.
// 3. Создать новую ветку, но не переходить на нее, удалить строку C, сделать коммит в master.
// 4. Перейти на ветку, созданную в пункте 4, удалить строкe D, сделать коммит.
// 5. Удалить строку E, вмержить изменения в master, удалить ветку в которой работали.
// 6. Сделать push в репозиторий.

A ----------------------------------------------------
public class HelloWorld {

B ----------------------------------------------------
	public static void main (String[] args) {
C ----------------------------------------------------
		System.out.println("Hello World!!!");
D ----------------------------------------------------
	}
E ----------------------------------------------------
}